/*&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&& hc574 驱动&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&
文件名称:SYS_WORK.h

文件作用:主程序运行参数

文件作者:Bai Bing

创建日期:2017年8月
使用说明:
&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&*/

#ifndef SYS_WORK_H
#define SYS_WORK_H

/************************函数声明**************************************/

void SYS_WORK(void);
void RCC_Configuration(void);
void SysClock_Init(void);
void REALY_DATA_DOWN(void);

/************************寄存器声明**************************************/


#endif
