/*&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&& led 驱动&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&
文件名称:wdg.c

文件作用:看门狗初始化

文件作者:GuiYang

创建日期:2013年4月
&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&*/

#include "include.h"



//***********************************************************************************************************************
//函数作用:看门狗初始化
//参数说明:
//注意事项:
//返回说明:无
//***********************************************************************************************************************
void dog_init(u16 interval)
{
	volatile u16 wait=0;
	
	//内部低速振荡器开启
	RCC->CSR|=(1<<0);
	while(!(RCC->CSR&(1<<1)));
	
	
	while(IWDG->SR);//等待可以写入

	//设置看门狗间隔
	IWDG->KR=0x5555;//解锁
	if(interval==5)IWDG->PR=5;//分频器
	else if(interval==30)IWDG->PR=7;//分频器
	IWDG->KR=0x5555;//解锁
	if(interval==5)IWDG->RLR=0x200;//计数器预装载
	else if(interval==30)IWDG->RLR=0xFFF;//计数器预装载
	for(wait=0;wait<100;wait++);
	//启动看门狗
	IWDG->KR=0xCCCC;
	//喂狗
	IWDG->KR=0xAAAA;
}

//***********************************************************************************************************************
//函数作用:喂看门狗
//参数说明:
//注意事项:
//返回说明:无
//***********************************************************************************************************************
void dog_feed(void)
{
	//喂狗
	IWDG->KR=0xAAAA;
}
